## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.cloudfront_ddos`      |
|        | `aws_cloudwatch_metric_alarm.route53_ddos`         |
|        | `aws_sns_topic.cloudwatch_warning_us_east`         |
|        | `aws_sns_topic_subscription.alert_warning_us_east` |
| update | `aws_sns_topic.cloudwatch_warning`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cloudfront_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for CloudFront"
      + alarm_name                            = "DDoS CloudFront"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:cloudfront::843973686572:distribution/E1R8W4OZAEKEKP"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.route53_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for Route53"
      + alarm_name                            = "DDoS Route53"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:route53:::hostedzone/Z00486671I4SMQMHD8PKB"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_sns_topic.cloudwatch_warning will be updated in-place
  ~ resource "aws_sns_topic" "cloudwatch_warning" {
        id                                       = "arn:aws:sns:ca-central-1:843973686572:cloudwatch-alarms-warning"
        name                                     = "cloudwatch-alarms-warning"
      ~ tags                                     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      ~ tags_all                                 = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic.cloudwatch_warning_us_east will be created
  + resource "aws_sns_topic" "cloudwatch_warning_us_east" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "cloudwatch-alarms-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning_us_east will be created
  + resource "aws_sns_topic_subscription" "alert_warning_us_east" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:843973686572:function:url-shortener-cloudwatch-alarms-slack"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.url_shortener_api_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.url_shortener_api_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shoretener_api_suspicious"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shoretener_api_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.url_shortener_api_error"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack"]

27 tests, 16 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
